xs2a-impl/src/test/resources/json/service/mapper/payment-initiation-response-201.json

{
  "transactionStatus": "RCVD",
  "transactionFees": {
    "currency": "EUR",
    "amount": "20.00"
  },
  "transactionFeeIndicator": true,
  "paymentId": "594ef79c-d785-41ec-9b14-2ea3a7ae2c7b",
  "scaMethods": [
    {}
  ],
  "challengeData": {},
  "psuMessage": "psu message",
  "currencyConversionFee": {
    "currency": "EUR",
    "amount": "1200"
  },
  "estimatedTotalAmount": {
    "currency": "EUR",
    "amount": "1300"
  },
  "estimatedInterbankSettlementAmount": {
    "currency": "EUR",
    "amount": "1500"
  }
}
